Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.prompt.placeholder.outputLanguagePlanner
source: Language for userVisiblePlan fields (scope / chips / semantic / notes).
ar: اللغة لحقول الخطة المرئية للمستخدم (النطاق / الرقائق / الدلالي / الملاحظات).
de: Sprache für userVisiblePlan-Felder (Scope/Chips/Semantik/Notizen).
es: Idioma para los campos userVisiblePlan (alcance / chips / semántica / notas).
fr: Langue pour les champs userVisiblePlan (scope / chips / semantic / notes).
id: Bahasa untuk bidang userVisiblePlan (scope / chips / semantic / notes).
it: Lingua per i campi userVisiblePlan (ambito / chip / semantica / note).
ja: userVisiblePlanフィールド（スコープ/チップ/セマンティック/メモ）の言語。
ko: userVisiblePlan 필드(범위/칩/의미/노트)의 언어입니다.
nl: Taal voor userVisiblePlan-velden (scope / chips / semantisch / notities).
pl: Język dla pól userVisiblePlan (zakres/chipy/semantyka/notatki).
pt_br: Idioma para os campos userVisiblePlan (escopo / chips / semântico / notas).
ru: Язык для полей userVisiblePlan (область / чипы / семантика / заметки).
tr: userVisiblePlan alanları için dil (kapsam / çipler / anlamsal / notlar).
uk: Мова для полів userVisiblePlan (область / чіпи / семантика / примітки).
vi: Ngôn ngữ cho các trường userVisiblePlan (phạm vi / chip / ngữ nghĩa / ghi chú).
zh_hans: userVisiblePlan 字段（scope / chips / semantic / notes）的文案语言。
zh_hant: userVisiblePlan 欄位（scope / chips / semantic / notes）的輸出語言。

# rag.workspace.prompt.placeholder.outputLanguageTitle
source: Display language for the conversation title (from Settings → Language).
ar: لغة العرض لعنوان المحادثة (من الإعدادات → اللغة).
de: Anzeigesprache für den Unterhaltungstitel (aus Einstellungen → Sprache).
es: Idioma de visualización para el título de la conversación (de Ajustes → Idioma).
fr: Langue d'affichage pour le titre de la conversation (depuis Réglages → Langue).
id: Bahasa tampilan untuk judul percakapan (dari Pengaturan → Bahasa).
it: Lingua di visualizzazione per il titolo della conversazione (da Impostazioni → Lingua).
ja: 会話タイトルの表示言語（設定→言語から）。
ko: 대화 제목의 표시 언어입니다(설정 → 언어).
nl: Weergavetaal voor de gesprekstitel (uit Instellingen → Taal).
pl: Język wyświetlania tytułu rozmowy (z Ustawień → Język).
pt_br: Idioma de exibição para o título da conversa (de Configurações → Idioma).
ru: Язык отображения заголовка разговора (из Настроек → Язык).
tr: Konuşma başlığı için görüntüleme dili (Ayarlar → Dil'den).
uk: Мова відображення назви розмови (з Налаштувань → Мова).
vi: Ngôn ngữ hiển thị cho tiêu đề cuộc trò chuyện (từ Cài đặt → Ngôn ngữ).
zh_hans: 会话标题的显示语言（来自设置 → 语言）。
zh_hant: 對話標題的顯示語言（來自設定 → 語言）。

# rag.workspace.prompt.placeholder.pastedGitHubLinks
source: Pasted GitHub repo identities and their Starcat relationship; no remote page content.
ar: هويات مستودعات GitHub الملصقة وعلاقتها بـ Starcat؛ بدون محتوى الصفحة البعيدة.
de: Eingefügte GitHub-Repo-Identitäten und ihre Starcat-Beziehung; kein Seiteninhalt.
es: Identidades de repositorios de GitHub pegadas y su relación con Starcat; sin contenido de página remota.
fr: Identités de dépôts GitHub collées et leur relation Starcat ; pas de contenu de page distant.
id: Identitas repositori GitHub yang ditempel dan hubungannya dengan Starcat; tanpa konten halaman jarak jauh.
it: Identità di repository GitHub incollate e loro relazione con Starcat; nessun contenuto di pagina remota.
ja: 貼り付けられたGitHubリポジトリの識別子とStarcatとの関係。リモートページの内容は含まれません。
ko: 붙여넣은 GitHub 저장소 ID와 Starcat 관계; 원격 페이지 콘텐츠는 포함되지 않습니다.
nl: Geplakte GitHub-repo-identiteiten en hun Starcat-relatie; geen externe pagina-inhoud.
pl: Wklejone tożsamości repozytoriów GitHub i ich relacja z Starcat; brak treści zdalnej strony.
pt_br: Identidades de repositórios do GitHub coladas e seu relacionamento com o Starcat; sem conteúdo remoto da página.
ru: Вставленные идентификаторы репозиториев GitHub и их связь со Starcat; без содержимого удалённой страницы.
tr: Yapıştırılan GitHub depo kimlikleri ve Starcat ilişkileri; uzak sayfa içeriği yok.
uk: Вставлені ідентифікатори репозиторіїв GitHub та їхній зв'язок із Starcat; без вмісту віддаленої сторінки.
vi: Danh tính kho GitHub đã dán và mối quan hệ Starcat của chúng; không có nội dung trang từ xa.
zh_hans: 粘贴的 GitHub 仓库身份及其 Starcat 关系，不包含远程页面正文。
zh_hant: 貼上的 GitHub 倉庫身份及其 Starcat 關係，不包含遠端頁面內容。

# rag.workspace.prompt.placeholder.previousReferencedRepositories
source: Repo IDs and full names actually cited by the previous assistant answer.
ar: معرفات المستودعات والأسماء الكاملة التي تم الاستشهاد بها فعليًا في إجابة المساعد السابقة.
de: Repo-IDs und vollständige Namen, die von der vorherigen Assistentenantwort tatsächlich zitiert wurden.
es: IDs y nombres completos de repositorios citados realmente por la respuesta anterior del asistente.
fr: Identifiants et noms complets des dépôts effectivement cités par la réponse précédente de l'assistant.
id: ID repositori dan nama lengkap yang benar-benar dikutip oleh jawaban asisten sebelumnya.
it: ID repository e nomi completi effettivamente citati dalla precedente risposta dell'assistente.
ja: 前回のアシスタント回答で実際に引用されたリポジトリIDとフルネーム。
ko: 이전 어시스턴트 답변에서 실제로 인용된 저장소 ID와 전체 이름입니다.
nl: Repo-ID's en volledige namen die daadwerkelijk zijn geciteerd in het vorige assistent-antwoord.
pl: Identyfikatory repozytoriów i pełne nazwy faktycznie przywołane w poprzedniej odpowiedzi asystenta.
pt_br: IDs e nomes completos dos repositórios realmente citados pela resposta anterior do assistente.
ru: Идентификаторы и полные имена репозиториев, фактически упомянутые в предыдущем ответе ассистента.
tr: Önceki asistan yanıtında fiilen alıntılanan depo kimlikleri ve tam adları.
uk: Ідентифікатори та повні назви репозиторіїв, фактично згадані в попередній відповіді асистента.
vi: ID kho và tên đầy đủ thực sự được trích dẫn bởi câu trả lời trợ lý trước đó.
zh_hans: 上一条助手回答实际引用的仓库 ID 与完整名称。
zh_hant: 上一則助手回答實際引用的倉庫 ID 與完整名稱。

# rag.workspace.prompt.placeholder.previousUserQuestion
source: The immediately previous user question, when available.
ar: سؤال المستخدم السابق مباشرة، عند توفره.
de: Die unmittelbar vorherige Benutzerfrage, falls vorhanden.
es: La pregunta inmediatamente anterior del usuario, cuando está disponible.
fr: La question utilisateur immédiatement précédente, si disponible.
id: Pertanyaan pengguna sebelumnya, jika tersedia.
it: La domanda utente immediatamente precedente, quando disponibile.
ja: 直前のユーザー質問（利用可能な場合）。
ko: 바로 이전 사용자 질문입니다(사용 가능한 경우).
nl: De direct vorige gebruikersvraag, indien beschikbaar.
pl: Bezpośrednio poprzednie pytanie użytkownika, jeśli dostępne.
pt_br: A pergunta imediatamente anterior do usuário, quando disponível.
ru: Непосредственно предыдущий вопрос пользователя, если доступен.
tr: Varsa, bir önceki kullanıcı sorusu.
uk: Попереднє запитання користувача, якщо доступне.
vi: Câu hỏi người dùng ngay trước đó, nếu có.
zh_hans: 上一条用户问题（如有）。
zh_hant: 上一則使用者問題（如有）。

# rag.workspace.prompt.placeholder.question
source: The current user question text.
ar: نص سؤال المستخدم الحالي.
de: Der aktuelle Benutzerfrage-Text.
es: El texto de la pregunta actual del usuario.
fr: Le texte de la question utilisateur actuelle.
id: Teks pertanyaan pengguna saat ini.
it: Il testo della domanda utente corrente.
ja: 現在のユーザー質問テキスト。
ko: 현재 사용자 질문 텍스트입니다.
nl: De huidige gebruikersvraagtekst.
pl: Tekst bieżącego pytania użytkownika.
pt_br: O texto da pergunta atual do usuário.
ru: Текст текущего вопроса пользователя.
tr: Geçerli kullanıcı sorusu metni.
uk: Текст поточного запитання користувача.
vi: Văn bản câu hỏi hiện tại của người dùng.
zh_hans: 当前用户问题原文。
zh_hant: 目前使用者問題原文。

# rag.workspace.prompt.placeholder.questionSection
source: User question plus the local query-plan block for this turn.
ar: سؤال المستخدم بالإضافة إلى كتلة خطة الاستعلام المحلية لهذا الدور.
de: Benutzerfrage plus der lokale Query-Plan-Block für diesen Abschnitt.
es: Pregunta del usuario más el bloque de plan de consulta local para este turno.
fr: Question utilisateur plus le bloc de plan de requête local pour ce tour.
id: Pertanyaan pengguna ditambah blok rencana kueri lokal untuk giliran ini.
it: Domanda utente più il blocco del piano di query locale per questo turno.
ja: ユーザー質問と今回のローカルクエリ計画ブロック。
ko: 사용자 질문과 이 턴의 로컬 쿼리 계획 블록입니다.
nl: Gebruikersvraag plus het lokale query-planblok voor deze beurt.
pl: Pytanie użytkownika plus lokalny blok planu zapytania dla tej tury.
pt_br: Pergunta do usuário mais o bloco do plano de consulta local para este turno.
ru: Вопрос пользователя плюс блок локального плана запроса для этого витка.
tr: Kullanıcı sorusu artı bu tur için yerel sorgu planı bloğu.
uk: Запитання користувача плюс блок локального плану запиту для цього кроку.
vi: Câu hỏi người dùng cộng với khối kế hoạch truy vấn cục bộ cho lượt này.
zh_hans: 本轮用户问题与本地查询计划段落。
zh_hant: 本輪使用者問題與本地查詢計劃段落。

# rag.workspace.prompt.placeholder.remoteSection
source: Temporary GitHub remote context for this turn. Empty when unused.
ar: سياق GitHub البعيد المؤقت لهذا الدور. فارغ عند عدم الاستخدام.
de: Temporärer GitHub-Remote-Kontext für diesen Abschnitt. Leer, wenn nicht verwendet.
es: Contexto remoto temporal de GitHub para este turno. Vacío cuando no se usa.
fr: Contexte GitHub distant temporaire pour ce tour. Vide si inutilisé.
id: Konteks jarak jauh GitHub sementara untuk giliran ini. Kosong jika tidak digunakan.
it: Contesto remoto GitHub temporaneo per questo turno. Vuoto quando non utilizzato.
ja: 今回の一時的なGitHubリモートコンテキスト。未使用時は空。
ko: 이 턴의 임시 GitHub 원격 컨텍스트입니다. 사용되지 않으면 비어 있습니다.
nl: Tijdelijke GitHub-remotecontext voor deze beurt. Leeg indien niet gebruikt.
pl: Tymczasowy zdalny kontekst GitHub dla tej tury. Pusty, gdy nieużywany.
pt_br: Contexto remoto temporário do GitHub para este turno. Vazio quando não utilizado.
ru: Временный удалённый контекст GitHub для этого витка. Пусто, если не используется.
tr: Bu tur için geçici GitHub uzak bağlamı. Kullanılmadığında boş.
uk: Тимчасовий віддалений контекст GitHub для цього кроку. Порожній, якщо не використовується.
vi: Ngữ cảnh GitHub từ xa tạm thời cho lượt này. Trống khi không sử dụng.
zh_hans: 本轮临时 GitHub 远程上下文；未使用时为空。
zh_hant: 本輪臨時 GitHub 遠端上下文；未使用時為空。

# rag.workspace.prompt.placeholder.repoContextSection
source: The selected project's code XML with commit, hash, and citation marker. It has an independent budget from indexed evidence and is empty unless deep thinking is enabled for exactly one project.
ar: XML كود المشروع المحدد مع الالتزام، التجزئة، وعلامة الاقتباس. له ميزانية مستقلة عن الأدلة المفهرسة ويكون فارغًا ما لم يتم تمكين التفكير العميق لمشروع واحد بالضبط.
de: Das Code-XML des ausgewählten Projekts mit Commit, Hash und Zitierungsmarkierung. Es hat ein unabhängiges Budget von indizierten Beweisen und ist leer, wenn Deep Thinking nicht für genau ein Projekt aktiviert ist.
es: XML del código del proyecto seleccionado con commit, hash y marcador de cita. Tiene un presupuesto independiente de la evidencia indexada y está vacío a menos que el pensamiento profundo esté habilitado para exactamente un proyecto.
fr: Le code XML du projet sélectionné avec commit, hash et marqueur de citation. Il a un budget indépendant des preuves indexées et est vide sauf si la réflexion approfondie est activée pour exactement un projet.
id: XML kode proyek yang dipilih dengan commit, hash, dan penanda kutipan. Memiliki anggaran independen dari bukti yang diindeks dan kosong kecuali pemikiran mendalam diaktifkan untuk tepat satu proyek.
it: XML del codice del progetto selezionato con commit, hash e marcatore di citazione. Ha un budget indipendente dalle prove indicizzate ed è vuoto a meno che il pensiero profondo non sia abilitato per esattamente un progetto.
ja: 選択したプロジェクトのコードXML（コミット、ハッシュ、引用マーカー付き）。インデックスエビデンスとは独立した予算を持ち、深い思考が有効なプロジェクトが1つの場合のみ空ではありません。
ko: 선택한 프로젝트의 코드 XML(커밋, 해시 및 인용 마커 포함)입니다. 인덱싱된 증거와 별도의 예산을 가지며, 정확히 하나의 프로젝트에 대해 심층 사고가 활성화된 경우에만 비어 있지 않습니다.
nl: De geselecteerde projectcode-XML met commit, hash en citatiemarkering. Het heeft een onafhankelijk budget van geïndexeerd bewijs en is leeg tenzij diep denken is ingeschakeld voor precies één project.
pl: Kod XML wybranego projektu z znacznikami commitu, skrótu i cytowania. Ma niezależny budżet od indeksowanych dowodów i jest pusty, chyba że włączone jest głębokie myślenie dla dokładnie jednego projektu.
pt_br: XML do código do projeto selecionado com commit, hash e marcador de citação. Possui um orçamento independente das evidências indexadas e fica vazio a menos que o pensamento profundo esteja ativado para exatamente um projeto.
ru: XML-код выбранного проекта с коммитом, хешем и маркером цитирования. Имеет независимый бюджет от индексированных свидетельств и пуст, если глубокое мышление не включено ровно для одного проекта.
tr: Seçilen projenin kod XML'i, işleme, hash ve alıntı işaretçisiyle. Dizinlenmiş kanıtlardan bağımsız bir bütçesi vardır ve yalnızca tam olarak bir proje için derin düşünme etkinse boş değildir.
uk: XML коду вибраного проєкту з комітом, хешем і маркером цитування. Має незалежний бюджет від індексованих доказів і порожній, якщо глибоке мислення не ввімкнено рівно для одного проєкту.
vi: Mã XML của dự án đã chọn với cam kết, hàm băm và dấu trích dẫn. Nó có ngân sách độc lập với bằng chứng đã lập chỉ mục và trống trừ khi bật suy nghĩ sâu cho chính xác một dự án.
zh_hans: 选中单项目的代码 XML，包含 commit、内容哈希与引用标记；预算独立于索引分片证据，只有在单项目开启深度思考时才有内容。
zh_hant: 選取專案的程式碼 XML，包含 commit、內容雜湊與引用標記；預算獨立於索引分片證據，只有在單一專案啟用深度思考時才有內容。

# rag.workspace.prompt.placeholders.generator
source: Placeholders: {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
ar: العناصر النائبة: {outputLanguage}، {questionSection}، {evidenceSection}، {remoteSection}، {attachmentSection}
de: Platzhalter: {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
es: Marcadores de posición: {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
fr: Espaces réservés : {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
id: Placeholder: {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
it: Segnaposto: {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
ja: プレースホルダー: {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
ko: 플레이스홀더: {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
nl: Plaatshouders: {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
pl: Symbole zastępcze: {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
pt_br: Espaços reservados: {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
ru: Плейсхолдеры: {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
tr: Yer tutucular: {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
uk: Плейсхолдери: {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
vi: Trình giữ chỗ: {outputLanguage}, {questionSection}, {evidenceSection}, {remoteSection}, {attachmentSection}
zh_hans: 可用占位符：{outputLanguage}、{questionSection}、{evidenceSection}、{remoteSection}、{attachmentSection}
zh_hant: 可用佔位符：{outputLanguage}、{questionSection}、{evidenceSection}、{remoteSection}、{attachmentSection}

# rag.workspace.prompt.placeholders.note
source: Delete a placeholder from the template to skip injecting that segment.
ar: احذف عنصرًا نائبًا من القالب لتخطي حقن ذلك الجزء.
de: Lösche einen Platzhalter aus der Vorlage, um das Einfügen dieses Segments zu überspringen.
es: Elimina un marcador de posición de la plantilla para omitir la inyección de ese segmento.
fr: Supprimez un espace réservé du modèle pour éviter d'injecter ce segment.
id: Hapus placeholder dari templat untuk melewatkan penyuntikan segmen tersebut.
it: Elimina un segnaposto dal modello per saltare l'iniezione di quel segmento.
ja: テンプレートからプレースホルダーを削除すると、そのセグメントの挿入をスキップします。
ko: 템플릿에서 플레이스홀더를 삭제하면 해당 세그먼트를 건너뜁니다.
nl: Verwijder een plaatshouder uit de sjabloon om het injecteren van dat segment over te slaan.
pl: Usuń symbol zastępczy z szablonu, aby pominąć wstawianie tego segmentu.
pt_br: Exclua um espaço reservado do modelo para pular a injeção desse segmento.
ru: Удалите плейсхолдер из шаблона, чтобы пропустить вставку этого сегмента.
tr: Bu bölümün eklenmesini atlamak için şablondan bir yer tutucuyu silin.
uk: Видаліть плейсхолдер із шаблону, щоб пропустити вставку цього сегмента.
vi: Xóa một trình giữ chỗ khỏi mẫu để bỏ qua việc chèn phân đoạn đó.
zh_hans: 从模板中删除某个占位符后，对应内容将不会注入。
zh_hant: 從範本中刪除某個佔位符後，對應內容將不會注入。

# rag.workspace.prompt.placeholders.open
source: Placeholders
ar: العناصر النائبة
de: Platzhalter
es: Marcadores de posición
fr: Espaces réservés
id: Placeholder
it: Segnaposto
ja: プレースホルダー
ko: 플레이스홀더
nl: Plaatshouders
pl: Symbole zastępcze
pt_br: Espaços reservados
ru: Плейсхолдеры
tr: Yer tutucular
uk: Плейсхолдери
vi: Trình giữ chỗ
zh_hans: 可用占位符
zh_hant: 可用佔位符

# rag.workspace.prompt.placeholders.openHelp
source: Show placeholder names and meanings
ar: إظهار أسماء ومعاني العناصر النائبة
de: Platzhalternamen und -bedeutungen anzeigen
es: Mostrar nombres y significados de los marcadores de posición
fr: Afficher les noms et significations des espaces réservés
id: Tampilkan nama dan arti placeholder
it: Mostra nomi e significati dei segnaposto
ja: プレースホルダー名と意味を表示
ko: 플레이스홀더 이름과 의미 표시
nl: Toon plaatshoudernamen en -betekenissen
pl: Pokaż nazwy i znaczenia symboli zastępczych
pt_br: Mostrar nomes e significados dos espaços reservados
ru: Показать имена и значения плейсхолдеров
tr: Yer tutucu adlarını ve anlamlarını göster
uk: Показати назви та значення плейсхолдерів
vi: Hiển thị tên và ý nghĩa trình giữ chỗ
zh_hans: 查看占位符名称与含义
zh_hant: 檢視佔位符名稱與含義

# rag.workspace.prompt.placeholders.planner
source: Placeholders: {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
ar: العناصر النائبة: {outputLanguage}، {question}، {explicitRepoIDs}، {explicitRepoMode}، {attachmentCount}
de: Platzhalter: {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
es: Marcadores de posición: {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
fr: Espaces réservés : {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
id: Placeholder: {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
it: Segnaposto: {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
ja: プレースホルダー: {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
ko: 플레이스홀더: {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
nl: Plaatshouders: {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
pl: Symbole zastępcze: {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
pt_br: Espaços reservados: {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
ru: Плейсхолдеры: {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
tr: Yer tutucular: {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
uk: Плейсхолдери: {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
vi: Trình giữ chỗ: {outputLanguage}, {question}, {explicitRepoIDs}, {explicitRepoMode}, {attachmentCount}
zh_hans: 可用占位符：{outputLanguage}、{question}、{explicitRepoIDs}、{explicitRepoMode}、{attachmentCount}
zh_hant: 可用佔位符：{outputLanguage}、{question}、{explicitRepoIDs}、{explicitRepoMode}、{attachmentCount}

# rag.workspace.prompt.placeholders.title
source: Placeholder Reference
ar: مرجع العناصر النائبة
de: Platzhalter-Referenz
es: Referencia de marcadores de posición
fr: Référence des espaces réservés
id: Referensi Placeholder
it: Riferimento segnaposto
ja: プレースホルダーリファレンス
ko: 플레이스홀더 참조
nl: Plaatshouderreferentie
pl: Odnośnik symboli zastępczych
pt_br: Referência de Espaços Reservados
ru: Справочник плейсхолдеров
tr: Yer Tutucu Referansı
uk: Довідка щодо плейсхолдерів
vi: Tham chiếu Trình giữ chỗ
zh_hans: 占位符说明
zh_hant: 佔位符說明

# rag.workspace.prompt.restoreDefaults
source: Restore Defaults
ar: استعادة الافتراضيات
de: Standard wiederherstellen
es: Restaurar valores predeterminados
fr: Restaurer les valeurs par défaut
id: Kembalikan Default
it: Ripristina impostazioni predefinite
ja: デフォルトに戻す
ko: 기본값 복원
nl: Standaardwaarden herstellen
pl: Przywróć domyślne
pt_br: Restaurar Padrões
ru: Восстановить стандартные
tr: Varsayılanları Geri Yükle
uk: Відновити стандартні
vi: Khôi phục Mặc định
zh_hans: 恢复默认
zh_hant: 恢復預設

# rag.workspace.prompt.restoreHelp
source: Restore the current tab to default prompts
ar: استعادة علامة التبويب الحالية إلى المطالبات الافتراضية
de: Den aktuellen Tab auf Standard-Prompts zurücksetzen
es: Restaurar la pestaña actual a los mensajes predeterminados
fr: Restaurer l'onglet actuel aux invites par défaut
id: Kembalikan tab saat ini ke prompt default
it: Ripristina la scheda corrente ai prompt predefiniti
ja: 現在のタブをデフォルトのプロンプトに戻す
ko: 현재 탭을 기본 프롬프트로 복원
nl: Herstel het huidige tabblad naar standaardprompts
pl: Przywróć bieżącą kartę do domyślnych promptów
pt_br: Restaurar a aba atual para os prompts padrão
ru: Восстановить стандартные подсказки для текущей вкладки
tr: Geçerli sekmeyi varsayılan istemlere geri yükle
uk: Відновити поточну вкладку до стандартних підказок
vi: Khôi phục tab hiện tại về lời nhắc mặc định
zh_hans: 将当前页提示词恢复为默认
zh_hant: 將目前頁籤的提示詞恢復為預設

# rag.workspace.prompt.save
source: Save
ar: حفظ
de: Speichern
es: Guardar
fr: Enregistrer
id: Simpan
it: Salva
ja: 保存
ko: 저장
nl: Bewaar
pl: Zapisz
pt_br: Salvar
ru: Сохранить
tr: Kaydet
uk: Зберегти
vi: Lưu
zh_hans: 保存
zh_hant: 儲存

# rag.workspace.prompt.system
source: System Prompt
ar: مطالبة النظام
es: Mensaje del sistema
fr: Invite système
id: Prompt Sistem
it: Prompt di sistema
ja: システムプロンプト
ko: 시스템 프롬프트
nl: Systeemprompt
pl: Prompt systemowy
pt_br: Prompt do Sistema
ru: Системная подсказка
tr: Sistem İstemi
uk: Системна підказка
vi: Lời nhắc Hệ thống
zh_hans: System 提示词
zh_hant: System 提示詞

# rag.workspace.prompt.tab.compressor
source: Compress
ar: ضغط
de: Komprimieren
es: Comprimir
fr: Compresser
id: Kompres
it: Comprimi
ja: 圧縮
ko: 압축
nl: Comprimeren
pl: Kompresuj
pt_br: Comprimir
ru: Сжатие
tr: Sıkıştır
uk: Стиснення
vi: Nén
zh_hans: 压缩
zh_hant: 壓縮

# rag.workspace.prompt.tab.generator
source: Q&A
ar: سؤال وجواب
de: F&A
es: Preguntas y respuestas
fr: Q&R
id: Tanya Jawab
nl: V&A
pl: Pytania i odpowiedzi
pt_br: Perguntas e Respostas
ru: Вопросы и ответы
tr: Soru-Cevap
vi: Hỏi & Đáp
zh_hans: 问答
zh_hant: 問答

# rag.workspace.prompt.tab.planner
source: Planner
ar: المخطط
de: Planer
es: Planificador
fr: Planificateur
id: Perencana
it: Pianificatore
ja: プランナー
ko: 계획
pl: Planista
pt_br: Planejador
ru: Планировщик
tr: Planlayıcı
uk: Планувальник
vi: Lập kế hoạch
zh_hans: 规划
zh_hant: 規劃

# rag.workspace.prompt.tab.title
source: Title
ar: العنوان
de: Titel
es: Título
fr: Titre
id: Judul
it: Titolo
ja: タイトル
ko: 제목
nl: Titel
pl: Tytuł
pt_br: Título
ru: Заголовок
tr: Başlık
uk: Назва
vi: Tiêu đề
zh_hans: 标题
zh_hant: 標題

# rag.workspace.prompt.title
source: RAG Prompt Settings
ar: إعدادات مطالبة RAG
de: RAG-Prompt-Einstellungen
es: Ajustes de mensajes RAG
fr: Paramètres d'invite RAG
id: Pengaturan Prompt RAG
it: Impostazioni prompt RAG
ja: RAGプロンプト設定
ko: RAG 프롬프트 설정
nl: RAG-promptinstellingen
pl: Ustawienia promptów RAG
pt_br: Configurações de Prompt RAG
ru: Настройки подсказок RAG
tr: RAG İstem Ayarları
uk: Налаштування RAG-підказок
vi: Cài đặt Lời nhắc RAG
zh_hans: RAG 提示词设置
zh_hant: RAG 提示詞設定
